import json

import requests

urls = [
    'https://api.retailrocket.ru/api/1.0/partner/5b151eb597a528b658db601e/items/?itemsIds=138270,140423,151161,151202,43467,119981,146994,146995,113387,151169,151190,119993,120008,128122,41624,119900,119901,119902,119903,134699,117419,124629,151173,155680,138252,151163,42570,42575,42577,44586,159179,43465,146681,146682,119983,41622,149572,113391,151175,104733,153910,148714,148716,148718,148720,119985,41598,41911,43487,43617,45708,140495,140497,43457,113385,42538,155682,155684,155686,119989,120007,41600,102528,117421,151177,120001,120010,128135&stock=&format=json',
    'https://api.retailrocket.ru/api/1.0/partner/5b151eb597a528b658db601e/items/?itemsIds=134586,154259,154260,134588,156064,156065,138825,148714,148716,148718,148720,138835,148710,148712,134584,148700,148702,134582,138270,140423,151161,41916,41918,41933,41942,113754,41913,41932,41941,43492,113752,113750,155682,155684,155686,41905,41910,41920,45709,140496,140498,138833,113385,140673,113746,124631,151167,138827,117421,151177,138829,140799,146399,102528,117419,124629,151173,112528,112529,113744,43457,155319,140671,138258,151165,112522,112523,140669,140677,146994,146995,41624,146687,146688&stock=&format=json']

data_parse = []
data_save = []
for url in urls:
    r = requests.get(url)
    data = r.json()
    for i in data:
        data_parse.append(i)
for i in data_parse:
    if len(data_save) < 100 and i['IsAvailable'] == True:
        data_save.append(i)

js = []
for i in data_save:
    data = {'id': i['ItemId'],
            'наименование': i['Name'],
            'ссылка на товар': i['Url'],
            'регулярная цена': i['OldPrice'],
            'промо цена': i['Price'],
            'бренд': i['Description']
            }
    json_data = json.dumps(data, ensure_ascii=False, indent=4)
    js.append(json_data)
with open('example.json', 'w', encoding='utf-8') as file:
    file.write('[\n')
    file.write(',\n'.join(js))
    file.write('\n]')
